#+TITLE: Introduction
#+DATE:
#+AUTHOR: Michael A Eager
#+OPTIONS: toc:nil H:5  <:t >:t 
#+OPTIONS:   H:5 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t >:t 
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+STARTUP: oddeven inlineimages hideblocks fold align hidestars 
#+TODO: REFTEX
#+LANGUAGE: en_GB-ise-wo_accents
#+LaTeX_CLASS: UoM-draft-org-article
#+LATEX_HEADER:\lfoot{\footnotesize\today\ at \thistime}
#+TODO: REFTEX                           
#+BIBLIOGRAPHY: ../org-manuscript/bib/MyBib plainnat
# unsrtnat
#+LATEX_HEADER: \graphicspath{{../LiteratureReview/gfx/}{../SimpleResponsesChapter/gfx/}}


#+LaTeX: \chapter{Introduction and Literature Review}\label{sec:Chapter1}

* Prelude                                                          :noexport:

#+name: changeset
#+BEGIN_SRC awk :results none :export none :in-file .hg/cache/tags
{print $1}
#+END_SRC


#+begin_src emacs-lisp results: silent
      (setq org-latex-to-pdf-process '("pdfquick %f" )) 
     ;; (setq org-latex-to-pdf-process '("make BUILD_STRATEGY=xelatex LitReview2.pdf")) 
     ;; (setq org-latex-to-pdf-process '("make BUILD_STRATEGY=pdflatex LitReview2.pdf")) 
     ;; (setq org-latex-to-pdf-process '("xelatex -interaction nonstopmode %f" "makeglossaries %b" "bibtex %b" "xelatex -interaction nonstopmode %f" "xelatex -interaction nonstopmode %f" ))
                                        
     (add-to-list 'org-export-latex-classes '("UoM-draft-org-article"
       "\\documentclass[11pt,a4paper,twoside,openright]{book}
       \\usepackage{../org-manuscript/style/uomthesis} 
       \\input{../org-manuscript/misc/user-defined}
       \\usepackage[nonumberlist,acronym]{glossaries}
       \\input{../org-manuscript/misc/glossary} 
       \\makeglossaries
       \\setcounter{secnumdepth}{5}      
       \\pretolerance=150 
       \\tolerance=100
       \\setlength{\\emergencystretch}{3em} 
       \\overfullrule=1mm %
       % \\usepackage[notcite]{showkeys} 
       \\lfoot{\\footnotesize\\today\\ at \\thistime  Hg:70} 
       \\usepackage{ifthen}
   
       [NO-DEFAULT-PACKAGES] [NO-PACKAGES]" 
       ("\\section{%s}" . "\n\\section{%s}")
       ("\\subsection{%s}" . "\n\\subsection{%s}") 
       ("\\subsubsection{%s}" . "\n\\subsubsection{%s}") 
       ("\\paragraph{%s}" . "\n\\paragraph{%s}")
       ("\\subparagraph{%s}" . "\n\\subparagraph{%s}")))
     
      (setq org-export-latex-title-command
            "{\\singlespacing\\tableofcontents\\printglossaries}") 
   ; (setq org-entities-user '(("space" "\\ " nil " " " " " " " ")))
     
#+end_src

#+RESULTS:
: {\singlespacing\tableofcontents\printglossaries}

